SnapBloks/SnapBloks/stm32/boards.txt
menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.opt=Optimize

menu.upload_method=Upload method

################################################################################

SnapBloks.name=SnapBloks

SnapBloks.build.core=STM32:arduino
SnapBloks.build.board=SnapBloks
SnapBloks.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

SnapBloks.menu.pnum.SNAPBLOKS_Discovery=SB072-Dicovery
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.upload.maximum_size=131072
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.upload.maximum_data_size=16384
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.build.mcu=cortex-m0
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.build.board=SB072_Discovery
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.build.series=STM32F0xx
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.build.product_line=STM32F072xB
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.build.variant=SB072_Discovery
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.build.cmsis_lib_gcc=arm_cortexM0l_math
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.build.startup_file=-DCUSTOM_STARTUP_FILE
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.build.bootloader_flags=-DVARIANT_SUPPORT_SOFTDFU
SnapBloks.menu.pnum.SNAPBLOKS_Discovery.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC

SnapBloks.menu.pnum.SNAPBLOKS_LED_RED=SB072-LED-RED
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.upload.maximum_size=65536
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.upload.maximum_data_size=16384
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.build.mcu=cortex-m0
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.build.board=SB072_LED_RED
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.build.series=STM32F0xx
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.build.product_line=STM32F072xB
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.build.variant=SB072_LED_RED
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.build.cmsis_lib_gcc=arm_cortexM0l_math
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.build.startup_file=-DCUSTOM_STARTUP_FILE
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.build.bootloader_flags=-DVARIANT_SUPPORT_SOFTDFU
SnapBloks.menu.pnum.SNAPBLOKS_LED_RED.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC

SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW=SB072-LED-YELLOW
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.upload.maximum_size=65536
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.upload.maximum_data_size=16384
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.build.mcu=cortex-m0
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.build.board=SB072_LED_YELLOW
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.build.series=STM32F0xx
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.build.product_line=STM32F072xB
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.build.variant=SB072_LED_YELLOW
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.build.cmsis_lib_gcc=arm_cortexM0l_math
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.build.startup_file=-DCUSTOM_STARTUP_FILE
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.build.bootloader_flags=-DVARIANT_SUPPORT_SOFTDFU
SnapBloks.menu.pnum.SNAPBLOKS_LED_YELLOW.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC

SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN=SB072-LED-GREEN
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.upload.maximum_size=65536
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.upload.maximum_data_size=16384
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.build.mcu=cortex-m0
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.build.board=SB072_LED_GREEN
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.build.series=STM32F0xx
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.build.product_line=STM32F072xB
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.build.variant=SB072_LED_GREEN
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.build.cmsis_lib_gcc=arm_cortexM0l_math
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.build.startup_file=-DCUSTOM_STARTUP_FILE
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.build.bootloader_flags=-DVARIANT_SUPPORT_SOFTDFU
SnapBloks.menu.pnum.SNAPBLOKS_LED_GREEN.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC

SnapBloks.menu.xserial.generic=Enabled (generic 'Serial')
SnapBloks.menu.xserial.none=Enabled (no generic 'Serial')
SnapBloks.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
SnapBloks.menu.xserial.disabled=Disabled (no Serial support)
SnapBloks.menu.xserial.disabled.build.xSerial=

SnapBloks.menu.usb.none=None
SnapBloks.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
SnapBloks.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
SnapBloks.menu.usb.CDC=CDC (no generic 'Serial')
SnapBloks.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
SnapBloks.menu.usb.HID=HID (keyboard and mouse)
SnapBloks.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE

SnapBloks.menu.xusb.FS=Low/Full Speed
SnapBloks.menu.xusb.HS=High Speed
SnapBloks.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
SnapBloks.menu.xusb.HSFS=High Speed in Full Speed mode
SnapBloks.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

SnapBloks.menu.opt.osstd=Smallest (-Os default)
SnapBloks.menu.opt.oslto=Smallest (-Os) with LTO
SnapBloks.menu.opt.oslto.build.flags.optimize=-Os -flto
SnapBloks.menu.opt.o1std=Fast (-O1)
SnapBloks.menu.opt.o1std.build.flags.optimize=-O1
SnapBloks.menu.opt.o1lto=Fast (-O1) with LTO
SnapBloks.menu.opt.o1lto.build.flags.optimize=-O1 -flto
SnapBloks.menu.opt.o2std=Faster (-O2)
SnapBloks.menu.opt.o2std.build.flags.optimize=-O2
SnapBloks.menu.opt.o2lto=Faster (-O2) with LTO
SnapBloks.menu.opt.o2lto.build.flags.optimize=-O2 -flto
SnapBloks.menu.opt.o3std=Fastest (-O3)
SnapBloks.menu.opt.o3std.build.flags.optimize=-O3
SnapBloks.menu.opt.o3lto=Fastest (-O3) with LTO
SnapBloks.menu.opt.o3lto.build.flags.optimize=-O3 -flto
SnapBloks.menu.opt.ogstd=Debug (-g)
SnapBloks.menu.opt.ogstd.build.flags.optimize=-g -Og

SnapBloks.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
SnapBloks.menu.upload_method.swdMethod.upload.protocol=0
SnapBloks.menu.upload_method.swdMethod.upload.options=-g
SnapBloks.menu.upload_method.swdMethod.upload.tool=STM32:stm32CubeProg

SnapBloks.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
SnapBloks.menu.upload_method.dfuMethod.upload.protocol=2
SnapBloks.menu.upload_method.dfuMethod.upload.options=-g
SnapBloks.menu.upload_method.dfuMethod.upload.tool=STM32:stm32CubeProg

SnapBloks.menu.upload_method.dfusMethod=Soft-DFU Upload
SnapBloks.menu.upload_method.dfusMethod.upload.protocol=softdfu
SnapBloks.menu.upload_method.dfusMethod.upload.tool=softdfu_upload
SnapBloks.menu.upload_method.dfusMethod.upload.usbID=0483:df11
SnapBloks.menu.upload_method.dfusMethod.upload.altID=0